package hw.hw2;

public class hw2_2 {
    public static void main(String[] args) {
        /*Задача 2
    Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….
*/
        for (int j = 90; j > 0; j-=5) {
            System.out.print(j + " ");
        }
    }
}
